'=====================================Git============================'
# Git- это распределенная системя контроля версий. Система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git можно организовать командную работу

# Репозиторий - это хранилище нашего кода и истории его изменений 
#Githun - это вебсайт для размещения git- репозиториев для совсестной разработке проектов

'''
git add. - добавит все файлы в индекс 
git commit -m'comment' - зафиксировать изменения 


'''
